--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\fshan\Projects\rufunsa\Untitled.log
  log type:  text
 opened on:   3 Jun 2025, 04:46:18

. tabulate Met_MMF Met_MDD, chi2

           |        Met_MDD
   Met_MMF |        no        yes |     Total
-----------+----------------------+----------
        no |        57          4 |        61 
       yes |        24          4 |        28 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   1.4011   Pr = 0.237

. tabulate Met_MMF Met_MDD, chi2

           |        Met_MDD
   Met_MMF |        no        yes |     Total
-----------+----------------------+----------
        no |        57          4 |        61 
       yes |        24          4 |        28 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   1.4011   Pr = 0.237

. 

. tabulate Met_MMF Met_MDD, chi2

           |        Met_MDD
   Met_MMF |        no        yes |     Total
-----------+----------------------+----------
        no |        57          4 |        61 
       yes |        24          4 |        28 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   1.4011   Pr = 0.237

. 

. tabulate Met_MAD Met_MDD, chi2

           |        Met_MDD
   Met_MAD |        no        yes |     Total
-----------+----------------------+----------
        no |        77          4 |        81 
       yes |         4          4 |         8 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =  18.0720   Pr = 0.000

. tabulate Micronutrients_Consumption Met_MDD, chi2

Micronutri |
ents_Consu |        Met_MDD
    mption |        no        yes |     Total
-----------+----------------------+----------
        no |        75          5 |        80 
       yes |         6          3 |         9 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   7.2536   Pr = 0.007

. tabulate Childgender Met_MDD, chi2

REFERENCE_ |
CHILD/gend |
er_of_the_ |        Met_MDD
     child |        no        yes |     Total
-----------+----------------------+----------
    female |        38          2 |        40 
      male |        43          6 |        49 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   1.4130   Pr = 0.235

. tabulate HH_head_Age_numCAT Met_MDD, chi2

HH_head_Ag |        Met_MDD
  e_numCAT |        no        yes |     Total
-----------+----------------------+----------
     15-19 |         1          0 |         1 
     20-24 |        10          1 |        11 
     25-29 |        18          2 |        20 
     30-34 |        19          1 |        20 
     35-39 |         6          1 |         7 
     40-44 |        10          1 |        11 
     45-49 |         6          2 |         8 
     50-54 |         2          0 |         2 
     55-59 |         4          0 |         4 
     60-64 |         1          0 |         1 
     65-69 |         1          0 |         1 
     70-74 |         1          0 |         1 
     75-79 |         2          0 |         2 
-----------+----------------------+----------
     Total |        81          8 |        89 

         Pearson chi2(12) =   4.3465   Pr = 0.976

. tabulate Respondent_Agenumcat4 Met_MDD, chi2

Respondent |
_Agenumcat |        Met_MDD
         4 |        no        yes |     Total
-----------+----------------------+----------
     18-19 |         7          2 |         9 
     20-24 |        26          1 |        27 
     25-29 |        24          3 |        27 
     30-34 |        16          0 |        16 
       >35 |         8          2 |        10 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(4) =   6.0595   Pr = 0.195

. tabulate HH_head_gender Met_MDD, chi2

DEMOGRAPHI |
C_INFORMAT |
ION/hh_hea |        Met_MDD
  d_gender |        no        yes |     Total
-----------+----------------------+----------
      male |        62          6 |        68 
    female |        19          2 |        21 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   0.0096   Pr = 0.922

. tabulate HH_member_Regular_Income Met_MDD, chi2

DEMOGRAPHI |
C_INFORMAT |
ION/hh_mem |
ber_with_r |
egular_inc |        Met_MDD
       ome |        no        yes |     Total
-----------+----------------------+----------
        no |        44          6 |        50 
       yes |        37          2 |        39 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   1.2647   Pr = 0.261

. tabulate Toilet Met_MDD, chi2

DEMOGRAPHI |
C_INFORMAT |
ION/type_o |        Met_MDD
  f_toilet |        no        yes |     Total
-----------+----------------------+----------
       Pit |        77          8 |        85 
     Flush |         4          0 |         4 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   0.4137   Pr = 0.520

. tabulate Grow_cowpea Met_MDD, chi2

Grow_cowpe |        Met_MDD
         a |        no        yes |     Total
-----------+----------------------+----------
        no |        68          6 |        74 
       yes |        13          2 |        15 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   0.4162   Pr = 0.519

. tabulate Prepare_Cowpea_for_children Met_MDD, chi2

DEMOGRAPHI |
C_INFORMAT |
ION/prepar |
e_cow_peas |
_meals_for |        Met_MDD
 _children |        no        yes |     Total
-----------+----------------------+----------
        no |        53          5 |        58 
       yes |        28          3 |        31 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   0.0276   Pr = 0.868

. tabulate Grow_soybean Met_MDD, chi2

Grow_soybe |        Met_MDD
        an |        no        yes |     Total
-----------+----------------------+----------
        no |        74          7 |        81 
       yes |         7          1 |         8 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   0.1325   Pr = 0.716

. tabulate Prepare_soya_meals_for_children Met_MDD, chi2

DEMOGRAPHI |
C_INFORMAT |
ION/prepar |
e_soya_bea |
ns_meals_f |
or_childre |        Met_MDD
         n |        no        yes |     Total
-----------+----------------------+----------
        no |        53          5 |        58 
       yes |        28          3 |        31 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   0.0276   Pr = 0.868

. tabulate increased_production Met_MDD, chi2

DEMOGRAPHI |
C_INFORMAT |
ION/increa |
sed_produc |
tion_durin |        Met_MDD
   g_covid |        no        yes |     Total
-----------+----------------------+----------
        no |        62          7 |        69 
       yes |        19          1 |        20 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   0.5017   Pr = 0.479

. tabulate Had_extention_Services Met_MDD, chi2

DEMOGRAPHI |
C_INFORMAT |
ION/have_e |
xtension_s |
ervices_du |        Met_MDD
ring_covid |        no        yes |     Total
-----------+----------------------+----------
        no |        72          8 |        80 
       yes |         9          0 |         9 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   0.9889   Pr = 0.320

. tabulate income_level_increased_in_Covid Met_MDD, chi2

DEMOGRAPHI |
C_INFORMAT |
ION/income |
_level_inc |
reased_dur |
ing_covid1 |        Met_MDD
         9 |        no        yes |     Total
-----------+----------------------+----------
        no |        70          6 |        76 
       yes |        11          2 |        13 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   0.7612   Pr = 0.383

. tabulate hired_labour_in_Covid Met_MDD, chi2

DEMOGRAPHI |
C_INFORMAT |
ION/hired_ |
labor_for_ |
hh_chores_ |
during_cov |        Met_MDD
        id |        no        yes |     Total
-----------+----------------------+----------
        no |        70          8 |        78 
       yes |        11          0 |        11 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   1.2396   Pr = 0.266

. tabulate Price_Increase_Covid Met_MDD, chi2

DEMOGRAPHI |
C_INFORMAT |
ION/experi |
ence_price |
_increase_ |
during_cov |        Met_MDD
        id |        no        yes |     Total
-----------+----------------------+----------
        no |        16          1 |        17 
       yes |        65          7 |        72 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   0.2479   Pr = 0.619

. tabulate Had_cash_Inputs_in_Covid Met_MDD, chi2

DEMOGRAPHI |
C_INFORMAT |
ION/have_c |
ash_for_in |
puts_durin |        Met_MDD
   g_covid |        no        yes |     Total
-----------+----------------------+----------
        no |        56          8 |        64 
       yes |        25          0 |        25 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   3.4336   Pr = 0.064

. tabulate Sub_imported_Food_Covid Met_MDD, chi2

DEMOGRAPHI |
C_INFORMAT |
ION/sub_im |
port_with_ |
local_duri |        Met_MDD
  ng_covid |        no        yes |     Total
-----------+----------------------+----------
        no |        71          6 |        77 
       yes |        10          2 |        12 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   0.9995   Pr = 0.317

. tabulate Ate_alternative_Food_Covid Met_MDD, chi2

DEMOGRAPHI |
C_INFORMAT |
ION/ate_al |
ternative_ |
food_durin |        Met_MDD
   g_covid |        no        yes |     Total
-----------+----------------------+----------
        no |        65          7 |        72 
       yes |        16          1 |        17 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   0.2479   Pr = 0.619

. tabulate opt_low_input_agric Met_MDD, chi2

DEMOGRAPHI |
C_INFORMAT |
ION/opt_lo |
w_input_ag |
ric_during |        Met_MDD
    _covid |        no        yes |     Total
-----------+----------------------+----------
        no |        37          4 |        41 
       yes |        44          4 |        48 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   0.0547   Pr = 0.815

. tabulate access_to_water_irrigation Met_MDD, chi2

DEMOGRAPHI |
C_INFORMAT |
ION/access |
_to_water_ |
irrig_duri |        Met_MDD
  ng_covid |        no        yes |     Total
-----------+----------------------+----------
        no |        29          5 |        34 
       yes |        52          3 |        55 
-----------+----------------------+----------
     Total |        81          8 |        89 

          Pearson chi2(1) =   2.1982   Pr = 0.138

. tabulate Social_protection Met_MDD, chi2

DEMOGRAPHIC_INFORMATI |
ON/support_from_govt_ |        Met_MDD
                  ngo |        no        yes |     Total
----------------------+----------------------+----------
farmer_input_support_ |         9          2 |        11 
                 none |        66          6 |        72 
school_feeding_progra |         1          0 |         1 
 social_cash_transfer |         5          0 |         5 
----------------------+----------------------+----------
                Total |        81          8 |        89 

          Pearson chi2(3) =   1.7668   Pr = 0.622

. exit, clear
